Revit 2026 API

# DuctFittingAndAccessoryConnectorData Properties

---

The DuctFittingAndAccessoryConnectorData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Angle | the angle of the fitting, Units:(rad). |
|  | Diameter | The connector diameter, Units:(ft). |
|  | Flow | The connector flow, Units:(ft³/s) |
|  | FlowDirection | the flow direction of this connector, In or Out. |
|  | Height | The connector height, Units:(ft). |
|  | Index | return the index of this connector |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LinkIndex | the index of the connector which is linked with this connector |
|  | Profile | The connector profile. |
|  | VelocityPressure | The connector velocity pressure. Units: (kg/(ft·s²)). |
|  | Width | The connector width, Units:(ft). |

#### Reference

DuctFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Mechanical Namespace